---
kind: method
id: M:Autodesk.Revit.DB.ExternalService.SingleServerService.GetActiveServerId
source: html/3a297e1f-c338-a53c-24b2-d63ac4c4b844.htm
---
# Autodesk.Revit.DB.ExternalService.SingleServerService.GetActiveServerId Method

Returns the Id of the currently active application-level server of the service.

## Syntax (C#)
```csharp
public Guid GetActiveServerId()
```

## Returns
The GUID of the active server, or an invalid GUID if there is no active server assigned.